# env stuff
brew "zoxide"
brew "zsh-autosuggestions"

# coding
tap  "oven-sh/bun"
brew "bun"
brew "asdf"
brew "deno"
brew "nvm"

# cli
brew "bat"
brew "gifski"
brew "htmlq"
brew "jq"
brew "ripgrep"

# gui
tap "FelixKratz/formulae"
brew "sketchybar"
brew "borders"
cask "nikitabobko/tap/aerospace"

# apps
cask "appcleaner"
cask "battle-net"
cask "brave-browser"
cask "cloudflare-warp"
cask "cursor"
cask "firefox"
cask "fork"
cask "iterm2"
cask "monitorcontrol"
cask "obsidian"
cask "openemu"
cask "raycast"
cask "rectangle"
cask "retroarch"
cask "signal"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "zed"
cask "zoom"

# fonts
cask "font-inter"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "sf-symbols"

# mac app store apps - might not need!
brew "mas"
mas "Gifski", id: 1351639930
