# env stuff
brew "zsh-autosuggestions"
brew "bat"
brew "zoxide"

# coding
tap  "oven-sh/bun"
brew "bun"
brew "nvm"
brew "asdf"

# cli
brew "jq"
brew "htmlq"

# apps
cask "alfred"
cask "appcleaner"
cask "battle-net"
cask "brave-browser"
cask "calibre"
cask "cloudflare-warp"
cask "firefox"
cask "fork"
cask "iterm2"
cask "monitorcontrol"
cask "obsidian"
cask "rectangle"
cask "signal"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "zed"
cask "zoom"

# fonts
cask "font-inter"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# mac app store apps - might not need!
# brew "mas"
